---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationPartLiningArea
source: html/2e511d59-f240-c14c-3dd9-5310b5ff4c43.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationPartLiningArea Property

"Lining Area"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationPartLiningArea { get; }
```